app/controllers/sessions_controller.rb

  def create
    input_username = params[:user][:username] #save username value submitted through form

    #if user exists, sign in
    if User.exists?(username: input_username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Samwise"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Samwise"], ["LIMIT", 1]]