app/controllers/submissions_controller.rb

SELECT "submissions".* FROM "submissions"
---
  def index
    @submissions = Submission.all

SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @submission = Submission.find(params[:id])

INSERT INTO "submissions" ("title", "author", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Fourth"], ["author", "Sam"], ["body", "This is the fourth post - cooking with gas"], ["created_at", 2017-01-28 20:20:05 UTC], ["updated_at", 2017-01-28 20:20:05 UTC]]
---
  def create
    @submission = Submission.create(submission_params)

SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "submissions" SET "body" = $1, "updated_at" = $2 WHERE "submissions"."id" = $3  [["body", "This is STILL the first post in the line"], ["updated_at", 2017-02-04 17:29:09 UTC], ["id", 1]]
---
  def update
    @submission = Submission.find(params[:id])
    @submission.update(submission_params)

SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @submission = Submission.find(params[:id])

SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "submissions" WHERE "submissions"."id" = $1  [["id", 5]]
---
  def destroy
    @submission = Submission.find(params[:id])
    @submission.destroy