app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password") VALUES ($1, $2) RETURNING "id"  [["username", "Samwise"], ["password", "password"]]
---
  def create
    @user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password" = $1 WHERE "users"."id" = $2  [["password", "password1"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)